
## Plan Result (koyashiro.sh)

[CI link](https://github.com/koyashiro/infra/actions/runs/8789404954)


<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_record.cname_dotfiles
  * cloudflare_record.cname_root
  * cloudflare_record.txt_dkim
  * cloudflare_record.txt_dmarc
  * cloudflare_record.txt_keybase_site_verification
  * cloudflare_record.txt_spf


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_record.cname_dotfiles will be created
  + resource "cloudflare_record" "cname_dotfiles" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "dotfiles"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "koyashiro-sh.pages.dev"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.cname_root will be created
  + resource "cloudflare_record" "cname_root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "koyashiro-sh.pages.dev"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_dkim will be created
  + resource "cloudflare_record" "txt_dkim" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "*._domainkey"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DKIM1; p="
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_dmarc will be created
  + resource "cloudflare_record" "txt_dmarc" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s;"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_keybase_site_verification will be created
  + resource "cloudflare_record" "txt_keybase_site_verification" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "keybase-site-verification=NNZVaBOMg3ALJyId1SRe4LGb6lxxYQr8Nau-yf1ut4w"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_spf will be created
  + resource "cloudflare_record" "txt_spf" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=spf1 -all"
      + zone_id         = (sensitive value)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":170,"Program":"tfcmt","SHA1":"c90bfebc6597a14cfe692c16019a35da9304549f","Target":"koyashiro.sh","Vars":{},"WorkflowName":"terraform"} -->